### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # azurerm_key_vault_access_policy.func_profile_kv_common will be created
  + resource "azurerm_key_vault_access_policy" "func_profile_kv_common" {
      + id                 = (known after apply)
      + key_vault_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.KeyVault/vaults/io-p-kv-common"
      + object_id          = "fff812bb-3a9e-40fd-8e6c-dcfa6b94b51d"
      + secret_permissions = [
          + "Get",
        ]
      + tenant_id          = "7788edaf-0346-4068-9d79-c868aed15b3d"
    }

  # azurerm_key_vault_access_policy.func_profile_staging_kv_common will be created
  + resource "azurerm_key_vault_access_policy" "func_profile_staging_kv_common" {
      + id                 = (known after apply)
      + key_vault_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.KeyVault/vaults/io-p-kv-common"
      + object_id          = "e3aa2d9e-3eda-406b-a064-f01849edf3cf"
      + secret_permissions = [
          + "Get",
        ]
      + tenant_id          = "7788edaf-0346-4068-9d79-c868aed15b3d"
    }

  # module.function_web_profile.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-webprof-rg-01/providers/Microsoft.Web/sites/io-p-itn-auth-webprof-func-01"
        name                                           = "io-p-itn-auth-webprof-func-01"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Auth&Identity"
            "ModuleName"                                     = "azure_function_app"
            "ModuleSource"                                   = "DX"
            "ModuleVersion"                                  = "1.0.1"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
            "hidden-link: /app-insights-conn-string"         = "InstrumentationKey=ab45103a-cb4f-474b-933f-d802ed1082d5;IngestionEndpoint=https://westeurope-3.in.applicationinsights.azure.com/;LiveEndpoint=https://westeurope.livediagnostics.monitor.azure.com/;ApplicationId=2a5ffa17-99f9-4d9b-a253-18dba6759d94"
            "hidden-link: /app-insights-instrumentation-key" = "ab45103a-cb4f-474b-933f-d802ed1082d5"
            "hidden-link: /app-insights-resource-id"         = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/microsoft.insights/components/io-p-ai-common"
        }
        # (34 unchanged attributes hidden)

      ~ sticky_settings {
          ~ app_setting_names       = [
              - "APPINSIGHTS_SAMPLING_PERCENTAGE",
              - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__initialSamplingPercentage",
              - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__maxSamplingPercentage",
              - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__minSamplingPercentage",
              - "AzureFunctionsWebHost__hostid",
                "SLOT_TASK_HUBNAME",
              - "TEST_ENV_2",
              - "TEST_ENV",
                "AzureFunctionsJobHost__extensions__durableTask__hubName",
              + "APPINSIGHTS_SAMPLING_PERCENTAGE",
              + "AzureFunctionsWebHost__hostid",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__minSamplingPercentage",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__maxSamplingPercentage",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__initialSamplingPercentage",
            ]
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.iam_kv.module.kv_func["00c42c7a-7fa8-43b8-b250-85d63c29d0cc"].module.key_vault.azurerm_role_assignment.secrets["io-p-itn-auth-main-rg-01|io-p-itn-auth-kv-01|reader"] will be created
  + resource "azurerm_role_assignment" "secrets" {
      + condition_version                = (known after apply)
      + description                      = "Grant read access to Key Vault secrets for provided Function Apps"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "00c42c7a-7fa8-43b8-b250-85d63c29d0cc"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-auth-kv-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.iam_kv.module.kv_func["0841384e-9cad-453d-b2da-73ed1d079555"].module.key_vault.azurerm_role_assignment.secrets["io-p-itn-auth-main-rg-01|io-p-itn-auth-kv-01|reader"] will be created
  + resource "azurerm_role_assignment" "secrets" {
      + condition_version                = (known after apply)
      + description                      = "Grant read access to Key Vault secrets for provided Function Apps"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0841384e-9cad-453d-b2da-73ed1d079555"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-auth-kv-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.iam_kv.module.kv_func["115eb3ca-00ee-4134-ad12-a9daaabff699"].module.key_vault.azurerm_role_assignment.secrets["io-p-itn-auth-main-rg-01|io-p-itn-auth-kv-01|reader"] will be created
  + resource "azurerm_role_assignment" "secrets" {
      + condition_version                = (known after apply)
      + description                      = "Grant read access to Key Vault secrets for provided Function Apps"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "115eb3ca-00ee-4134-ad12-a9daaabff699"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-auth-kv-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.iam_kv.module.kv_func["321ab3f4-344b-4672-ab5a-029a4a72c452"].module.key_vault.azurerm_role_assignment.secrets["io-p-itn-auth-main-rg-01|io-p-itn-auth-kv-01|reader"] will be created
  + resource "azurerm_role_assignment" "secrets" {
      + condition_version                = (known after apply)
      + description                      = "Grant read access to Key Vault secrets for provided Function Apps"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "321ab3f4-344b-4672-ab5a-029a4a72c452"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-auth-kv-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.iam_kv.module.kv_func["544c3add-da8b-4fc1-8e4f-0f750cfdafa8"].module.key_vault.azurerm_role_assignment.secrets["io-p-itn-auth-main-rg-01|io-p-itn-auth-kv-01|reader"] will be created
  + resource "azurerm_role_assignment" "secrets" {
      + condition_version                = (known after apply)
      + description                      = "Grant read access to Key Vault secrets for provided Function Apps"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "544c3add-da8b-4fc1-8e4f-0f750cfdafa8"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-auth-kv-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.iam_kv.module.kv_func["9f0a1505-260e-46fc-a130-fea5519f7666"].module.key_vault.azurerm_role_assignment.secrets["io-p-itn-auth-main-rg-01|io-p-itn-auth-kv-01|reader"] will be created
  + resource "azurerm_role_assignment" "secrets" {
      + condition_version                = (known after apply)
      + description                      = "Grant read access to Key Vault secrets for provided Function Apps"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "9f0a1505-260e-46fc-a130-fea5519f7666"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-auth-kv-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.iam_kv_ioweb.module.kv_func["e3aa2d9e-3eda-406b-a064-f01849edf3cf"].module.key_vault.azurerm_role_assignment.secrets["io-p-itn-auth-main-rg-01|io-p-itn-ioweb-kv-01|reader"] will be created
  + resource "azurerm_role_assignment" "secrets" {
      + condition_version                = (known after apply)
      + description                      = "Grant read access to Key Vault secrets for provided Function Apps"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "e3aa2d9e-3eda-406b-a064-f01849edf3cf"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-ioweb-kv-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.iam_kv_ioweb.module.kv_func["fff812bb-3a9e-40fd-8e6c-dcfa6b94b51d"].module.key_vault.azurerm_role_assignment.secrets["io-p-itn-auth-main-rg-01|io-p-itn-ioweb-kv-01|reader"] will be created
  + resource "azurerm_role_assignment" "secrets" {
      + condition_version                = (known after apply)
      + description                      = "Grant read access to Key Vault secrets for provided Function Apps"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "fff812bb-3a9e-40fd-8e6c-dcfa6b94b51d"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-ioweb-kv-01"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 10 to add, 1 to change, 0 to destroy.
```

</details>
